# VGG19

# parameters
nc: 1000  # number of classes

# backbone
backbone:
  [
    # Conv Block 1
    [-1, 1, Conv, [64, 3, 1, 1]],  # 0
    [-1, 1, Conv, [64, 3, 1, 1]],  # 2
    [-1, 1, MaxPool, [2, 2, 0]],   # 4
    
    # Conv Block 2
    [-1, 1, Conv, [128, 3, 1, 1]], # 5
    [-1, 1, Conv, [128, 3, 1, 1]], # 7
    [-1, 1, MaxPool, [2, 2, 0]],   # 9
    
    # Conv Block 3
    [-1, 1, Conv, [256, 3, 1, 1]], # 10
    [-1, 1, Conv, [256, 3, 1, 1]], # 12
    [-1, 1, Conv, [256, 3, 1, 1]], # 14
    [-1, 1, Conv, [256, 3, 1, 1]], # 16
    [-1, 1, MaxPool, [2, 2, 0]],   # 18
    
    # Conv Block 4
    [-1, 1, Conv, [512, 3, 1, 1]], # 19
    [-1, 1, Conv, [512, 3, 1, 1]], # 21
    [-1, 1, Conv, [512, 3, 1, 1]], # 23
    [-1, 1, Conv, [512, 3, 1, 1]], # 25
    [-1, 1, MaxPool, [2, 2, 0]],   # 27
    
    # Conv Block 5
    [-1, 1, Conv, [512, 3, 1, 1]], # 28
    [-1, 1, Conv, [512, 3, 1, 1]], # 30
    [-1, 1, Conv, [512, 3, 1, 1]], # 32
    [-1, 1, Conv, [512, 3, 1, 1]], # 34
    [-1, 1, MaxPool, [2, 2, 0]],   # 36
  ]

# head
head:
  [
    [-1, 1, Linear, [4096]], # 0
    [-1, 1, Dropout, [0.5]], # 2
    [-1, 1, ReLU, []],       # 4
    [-1, 1, Linear, ['nc']], # 6
    [-1, 1, Softmax, []],    # 7
  ]
